# SolidOptions Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
SolidOptions Class
Members See Also
---
A class containing optional information to control the properties of the Solid generated by the GeometryCreationUtilities routines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class SolidOptions : IDisposable
```

Visual Basic
---
```text
Public Class SolidOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class SolidOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..SolidOptions
# See Also
SolidOptions Members
Autodesk.Revit.DB Namespace